Revit 2026 API

# ProjectLocationSet Methods

---

The ProjectLocationSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every project location from the set, rendering it empty. |
|  | Contains | Tests for the existence of a project location within the set. |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | Erase | Removes a specified project location from the set. |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Insert | Insert the specified project location into the set. |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ProjectLocationSet Class

Autodesk.Revit.DB Namespace